Repository: persianpros/BackupSuite-PLi
Catalog: plugin/locale/*/LC_MESSAGES/BackupSuite.po
Languages: ru, sk, uk

source: The found files:
ru: Найденые файлы:
sk: Nájdené súbory:
uk: Знайдені файли:

source: %s (maybe error)
ru: %s (может быть ошибка)
sk: %s (možno chyba)
uk: %s (можлива помилка)

source: %s (maybe ok)
ru: %s (может быть ок
sk: %s (možno ok)
uk: %s (можливо добре)

source: MB available space
ru: МБ свободного места
sk: MB volného miesta
uk: МБ вільного місця

source: MB needed space
ru: МБ необходимо
sk: MB potrebného miesta
uk: МБ необхідно

source: nothing!
ru: ничего нет!
sk: nič!
uk: нічого нема!

source: size to be backed up:
ru: размер резервной копии:
sk: zálohovaná veľkosť:
uk: розмір резервної копії:

source: to make a back-up!
ru: чтобы создать резервную копию!
sk: pre vytvorenie zálohy!
uk: щоб створити резервну копію!

source: * * * WARNING * * *
ru: * * * ВНИМАНИЕ * * *
sk: * * * Varovanie * * *
uk: * * * УВАГА * * *

source: A recording is currently running. Please stop the recording before trying to start a flashing.
ru: В данный момент выполняется запись. Пожалуйста, остановите её, перед началом прошивки!
sk: V súčasnej dobe prebieha nahrávanie. Pred pokusom o spustenie obnovy prosím zastavte nahrávanie.
uk: В даний момент виконується запис. Будь-ласка, зупиніть її перед початком прошивки!

source: Additional backup ->
ru: Дополнительная резервная копия ->
sk: Ďalšia záloha ->
uk: Додаткова резервна копія ->

source: BACK-UP TOOL, FOR MAKING A COMPLETE BACK-UP
ru: УТИЛИТА ДЛЯ СОЗДАНИЯ ПОЛНОЙ РЕЗЕРВНОЙ КОПИИ
sk: BACK-UP nástroj na výrobu kompletnej zálohy operačného systému
uk: УТИЛІТА ДЛЯ СТВОРЕННЯ ПОВНОЇ РЕЗЕРВНОЇ КОПІЇ

source: Backup > HDD
ru: Бэкап > HDD
sk: Záloha > HDD
uk: Бекап > HDD

source: Backup > MMC
sk: Záloha > MMC

source: Backup > USB
ru: Бэкап > USB
sk: Záloha > USB
uk: Бекап > USB

source: Backup and restore your image
sk: Zálohovať a obnoviť zálohu systému

source: Backup done with:
ru: Резервная копия сделана со скоростью:
sk: Záloha vytvorená:
uk: Резервна копія зроблена зі швидкістю:

source: Backup finished and copied to your USB-flashdrive.
ru: Резервное копирование закончено и теперь копируются файлы на USB носитель.
sk: Zálohovanie bolo dokončené a skopírované na USB.
uk: Резервне копіювання закінчено і зараз копіюються файли на USB носій.

source: Create: kerneldump
ru: Создаём: kerneldump
sk: Vytvára sa : Kerneldump
uk: Створюєм: kerneldump

source: Create: root.ubifs
ru: Создаём: root.ubifs
sk: Vytvára sa : root.ubifs
uk: Створюєм: root.ubifs

source: Do you really want to unpack %s ?
ru: Вы действительно хотите распаковать %s?
sk: Naozaj chcete rozbaliť %s ?
uk: Вы дійсно бажаєте розпакувати %s?

source: Do you want to make a back-up on USB? This only takes a few minutes depending on the used filesystem and is fully automatic. Make sure you first insert an USB flash drive before you select Yes.
ru: Вы хотите сделать резервную копию прошивки на USB? Это займёт всего несколько минут в зависимости от файловой системы, процесс полностью автоматизирован. Убедитесь, что Вы вставили USB флеш носитель, прежде чем выбрать Да.
sk: Chcete vytvoriť zálohu na USB? Dĺžka zálohovania závisí na použitom súborovom systéme, je plne automacitká a trvá iba niekoľko minút. Uistite sa, že je USB disk zasunutý pred tým, ako stlačíte Áno.
uk: Ви бажаєте зробити резервну копію прошивки на USB? Це займе всього декілька хвилин в залежності від файлової системи, процес повністю автоматизований. Переконайтесь що Ви вставили USB флеш носій, перш ніж вибрати Так.

source: Do you want to make an USB-back-up image on HDD? This only takes a few minutes and is fully automatic.
ru: Вы хотите сделать резервную копию прошивки на HDD? Это займёт всего несколько минут, процесс полностью автоматизирован.
sk: Chcete vytvoriť USB zálohu operačného systému na HDD? Záloha je plne automatická a trvá iba niekoľko minút.
uk: Ви бажаєте зробити резервну копію прошивки на HDD? Це займе всього декілька хвилин в залежності від файлової системи, процес повністю автоматизований.

source: Do you want to make an USB-back-up image on MMC? This only takes a few minutes and is fully automatic.
sk: Chcete vytvoriť USB zálohu operačného systému na pamäťovú kartu? Záloha je plne automatická a trvá iba niekoľko minút.

source: Exit
ru: Выход
sk: Ukončiť
uk: Вихід

source: For flashing your receiver files are needed:
ru: Для прошивки Вашего ресивера необходимы файлы:
sk: Pre obnovenie sú potrebné súbory:
uk: Для прошивки Вашего ресивера необхідні файли:

source: Full back-up direct to USB
ru: Полная резервная копия непосредственно на USB
sk: Plná záloha priamo na USB
uk: Повна резервна копія безпосередньо на USB

source: Full back-up on HDD
ru: Полная резервная копия на HDD
sk: Plná záloha na HDD
uk: Повна резервна копія на HDD

source: Full back-up on MMC
sk: Plná záloha na MMC

source: Full back-up to USB
ru: Полная резервная копия на USB
sk: Plná záloha na USB
uk: Повна резервна копія на USB

source: Full back-up to the MultiMediaCard
sk: Plná záloha na pamäťovú kartu (MMC)

source: Full back-up to the harddisk
ru: Полная резервная копия на жёсткий диск
sk: Plná záloha na harddisk
uk: Повна резервна копія на жорсткий диск

source: If you place an USB-stick containing this file then the back-up will be automatically made onto the USB-stick and can be used to restore the current image if necessary.
ru: Если подключить USB-флешку, содержащую этот файл, то резервная копия будет автоматически создана на USB-флешке и, если это будет необходимо, может быть использована для восстановления прошивки.
sk: Ak zasuniete USB disk obsahujúci tento súbor, záloha bude automaticky vykonaná na tento disk a môže byť neskôr použitá na obnovenie zálohy OS v prípade potreby.
uk: Якщо підключити USB-флешку, яка містить цей файл, то резервна копія буде автоматично створена на USB-флешці і, якщо це буде необхідно, може бути використана для відновлення прошивки.

source: Image creation FAILED!
ru: Создание прошивки завершилось ОШИБКОЙ!
sk: Vytvorenie zálohy OS zlyhalo!
uk: Створення прошивки завершилось ПОМИЛКОЮ!

source: Installed packages contained in this backup:
sk: Inštalované balíky dostupné v tejto zálohe:

source: KB per second
ru: КБ в секунду
sk: KB za sekundu
uk: КБ в секунду

source: Make a backup or restore a backup
ru: Создание или восстановление бэкапа
sk: Vytvoriť zálohu alebo obnoviť zálohu
uk: Створення або відновлення бекапа

source: Most likely this back-up can't be restored because of it's size, it's simply too big to restore. This is a limitation of the bootloader not of the back-up or the BackupSuite.
ru: Скорее всего, этот бэкап не может быть восстановлен из-за размера, т.к. он слишком большой. Это ограничение загрузчика, а не прошивки или BackupSuite.
sk: S najväčšou pravdepodobnosťou sa záloha nedá obnoviť, pretože je príliš velká pre obnovenie. Jedná sa o obmedzenie bootloadera, nie o chybu v zálohe alebo chybu doplnku BackupSuite.
uk: Цей бекап не може бути створений через розмір, т.як. він дуже великий. Це обмеження загрузчика, а не прошивки або БекапаЛюкс.

source: NFI Image created in:
sk: NFI záloha vytvorená v:

source: NOT found files for flashing!
ru: Не найдены файлы для быстрой прошивки!
sk: Neboli nájdené súbory pre obnovenie zálohy!
uk: Не знайдені файли для швидкої прошивки!

source: No additional USB-stick found to copy an extra backup
sk: Na vytvorenie extra zálohy nebol nájdený dodatočný USB disk

source: No supported receiver found!
ru: Найден не поддерживаемый ресивер!
sk: Nebol nájdený žiadny podporovaný prijímač!
uk: Знайдено не існуючий ресивер!

source: Not enough free space on
ru: Недостаточно свободного места на
sk: Nedostatok volného miesta na
uk: Недостатньо вільного місця на

source: Only kernel
ru: Только ядро
sk: Iba kernel
uk: Тільки ядро

source: Only root
ru: Только имидж
sk: Iba root
uk: Тільки імідж

source: PLEASE READ THIS:
ru: ПОЖАЛУЙСТА ПРОЧТИТЕ ЭТО:
sk: Prosím prečítajte si toto:
uk: БУДЬ-ЛАСКА ПРОЧИТАЙТЕ ЦЕ:

source: Please be patient, a backup will now be made, this will take about:
ru: Пожалуйста, будьте терпеливы, создание резервной копии началось, это займёт около:
sk: Buďte prosím trpezlivý, vytvorí sa záloha operačného systému, ktorá potrvá približne:
uk: Створення резервної копії почалося, це займе близько:

source: Please check the manual of the receiver on how to restore the image.
ru: Пожалуйста, обратитесь к инструкции ресивера о том, как восстановить прошивку.
sk: Skontrolujte si prosím v príručke prijímača, ako obnoviť zálohu Image.
uk: Читайте інструкцію як відновити прошивку.

source: Please: DO NOT reboot your STB and turn off the power.
ru: Пожалуйста, НЕ перезагружайте Ваш ресивер и НЕ выключайте питание!
sk: Upozornenie: Nereštartujte STB ani nevypínajte napájanie.
uk: НЕ перезагружайте Ваш ресивер і НЕ виключайте ток!

source: Probably you are trying to make the back-up in flash memory
sk: Pravdepodobne sa pokúšate vytvoriť zálohu vo flash pamäti

source: Restore backup
ru: Восстановить
sk: Obnoviť zálohu
uk: Відновити

source: Run flash
ru: Прошить
sk: Spustiť obnovu
uk: Прошити

source: Select parameter for start flash!
ru: Выберите параметры для старта быстрой прошивки!
sk: Vyberte parameter pre spustenie obnovy!
uk: Виберіть параметри для старту швидкої прошивки!

source: Select the folder with backup
ru: Выберите папку с бэкапом
sk: Vyberte zložku so zálohou
uk: Виберіть папку з бекапом

source: Show only found image and mtd partitions.
ru: Показывать только найденные имиджи и mtd разделы
sk: Zobraziť iba nájdený Image a MTD oddiely..
uk: Показувати тільки знайдені іміджі і mtd розділи

source: Simulate (no write)
ru: Имитация (без записи)
sk: Simulácia (bez zápisu)
uk: Імітація (без запису)

source: Some information about the task
ru: Некоторая информация о задании
sk: Informácie o vykonávanej zálohe
uk: Деяка інформація про завдання

source: Standard (root and kernel)
ru: Стандарт (имидж и ядро)
sk: Štandard (root a kernel)
uk: Стандарт (імідж і ядро)

source: The content of the folder is:
ru: Содержание папки:
sk: Obsah zložky je:
uk: Створення папки:

source: The image or kernel will be flashing and auto booted in few minutes.
ru: Имидж или ядро будут перезаписаны и ресивер автоматически перезагрузится через несколько минут.
sk: Image alebo kernel bude obnovený a prijímač sa automaticky do niekolkých minút reštartuje.
uk: Імідж або ядро будуть перезаписані і ресивер автоматично перезагрузиться через декілька хвилин.

source: The program will abort, please try another medium with more free space to create your back-up.
ru: Процесс будет прерван, попробуйте другой носитель, на котором больше свободного места
sk: Proces bude prerušený, prosím skúste iné médium s dostatkom volného miesta pre vytvorenie zálohy.
uk: Процес буде перерваний, попробуйте другий носій, на якому більше вільного місця.

source: The program will exit now.
ru: Программа будет сейчас закрыта.
sk: Program bude ukončený.
uk: Програма будет зараз закрита.

source: There COULD be a problem with restoring this back-up because the size of the back-up comes close to the maximum size. This is a limitation of the bootloader not of the back-up or the BackupSuite.
ru: Может возникнуть проблема с восстановлением этой резервной копии, потому что её размер приближается к максимально возможному. Это ограничение загрузчика, а не прошивки или BackupSuite.
sk: Mohol by byť problém s obnovením téjto zálohy, pretože veľkosť zálohy sa blíži k maximálnej velkosti. Jedná sa o obmedzenie bootloadera, nie o chybu v zálohe alebo chybu doplnku BackupSuite.
uk: Може виникнути проблема з відновлення бекапу, завеликий розмір. Обмеження загрузчика.

source: There is NO valid USB-stick found, so I've got nothing to do.
ru: Обнаружен не поддерживаемый USB-накопитель, поэтому резервную копию нельзя сделать.
sk: Nebol nájdený potrebný USB disk, záloha sa nevykoná.
uk: Не підтримуючий USB-носій, бекап не можливо створити.

source: There is a valid USB-flashdrive detected in one of the USB-ports, therefore an extra copy of the back-up image will now be copied to that USB-flashdrive.
ru: Обнаружен поддерживаемый USB-накопитель в одном из USB-портов, поэтому дополнительная резервная копия прошивки будет скопирована на этот USB-накопитель.
sk: USB nájdený v jednom z USB portov, extra kópia zálohy operačného systému bude preto skopírovana na toto USB.
uk: Не підтримуючий USB-носій в одному з USB-портів, додатковий бекап буде скопійований на цей USB-носій.

source: This only takes about 20 seconds.....
ru: Это займёт около 20 секунд!
sk: Potrvá to približne 20 sekúnd .....
uk: Це займе 20 секунд!

source: Time required for this process:
ru: Время, необходимое для этой процедуры:
sk: Čas potrebný pre tento proces:
uk: Час, необхідний для цієї процедури:

source: To back-up directly to the USB-stick, the USB-stick MUST contain a file with the name:
ru: Для прямого копирования на USB-флешку, ФЛЕШКА должна содержать файл с именем:
sk: Ak chcete zálohovať priamo na USB disk, tento musí obsahovať súbor s názvom:
uk: Для прямого копіювання на USB-флешку, ФЛЕШКА має містити файл з іменем:

source: USB Image created in:
ru: USB прошивка создана в:
sk: USB záloha vytvorená v:
uk: USB прошивка створена в:

source: Unzip
ru: Распаковать
sk: Rozbaliť
uk: Розпакувати

source: Using your own custom lookuptable.txt from the folder /etc
sk: Použije sa váš vlastný lookuptable.txt zo zložky /etc

source: Version unknown, probably not installed the right way.
sk: Verzia neznáma, pravdepodobne nebola správne nainštalovaná.

source: Warning! Use at your own risk! Make always a backup before use! Don't use it if you use multiple ubi volumes in ubi layer!
ru: Важно! Используйте быструю прошивку на свой страх и риск! Всегда делайте бэкап перед каждым применением! Не используйте его, если Вы имеете несколько томов ubi!
sk: Varovanie! Používate na vlastné riziko! Odporúčame urobiť zálohu pred každým použitím! Nepoužívajte to, ak používate viac Ubi jednotiek v UBI vrstve!
uk: Увага! Використовуйте швидку прошивку на свій страх і ризик! Завжди робіть бекап перед кожним застосуванням! Не використовуйте його, якщо Ви маєте декілька томів ubi!

source: What is new since the last release?
ru: Что нового с последнего релиза?
sk: Čo je nové od poslednej verzie?
uk: Що нового з остатнього реліза?

source: Your STB will freeze during the flashing process.
ru: Ваш ресивер будет заблокирован на время процесса быстрой прошивки!
sk: Počas procesu obnovy môže Váš STB prestať reagovať.
uk: Ваш ресивер буде заблоковано на час процесу швидкої прошивки!

source: and there is made an extra copy in:
ru: и сделать дополнительную резервную копию:
sk: a ďalšia vytvorená kópia v:
uk: і зробити додаткову резервну копію:

source: available
ru: доступный
sk: dostupných
uk: доступний

source: backupstick or
ru: backupstick или
sk: backupstick alebo
uk: backupstick або

source: current: %s
ru: Текущая: %s
sk: adresár: %s
uk: Поточна: %s

source: is not executable...
sk: nie je spustiteľný...

source: minutes
ru: минут
sk: minút
uk: хвилин

source: not found, the backup process will be aborted!
ru: не найден, процесс резервного копирования будет прерван!
sk: nebol nájdený, proces zálohovania bude prerušený!
uk: не знайдено, процес резервного копіювання буде перервано!

source: not installed yet, now installing
sk: ešte nie je nainštalované, inštalujem teraz

source: ofgwrite will stop enigma2 now to run the flash.
ru: утилита ofgwrite остановит сейчас enigma2 для быстрой прошивки!
sk: Pre spustenie obnovy systému ofgwrite ukončí beh OS Enigma.
uk: утиліта ofgwrite зупинить зараз enigma2 для швидкої прошивки!

source: Cancel
ru: Отмена
uk: Відміна

source: Flashing:
ru: Быстрая прошивка:
uk: Швидка прошивка:

source: BackupSuite
ru: Бэкап-Люкс
uk: Бекап-Люкс
